workshop-presentation.org
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* Why use FOSS?
- Avoid proprietary "black box" tools.
  Transparency
- Power of Plaintext over proprietary tools
  Accessible long-term, available to more users, no lock-in.
- Everything in one place
  1. Editor
  2. File browser/manager
  3. Programming notebooks
  4. Markdown, TeX docs
  5. Remote file editing for my server via TRAMP
  6. To-Do lists, calendar
  7. Easy exportability of files to .html, .pdf, etc.
- Hardware longevity
  Almost everyone has old PC's sitting around, which are great for Linux.
  You'll be surprised how well it runs on so little vs proprietary stuff.
  My PC is 5+ years old, runs great on RPi's also.
- Malleable software
  Modify to your heart's content or build your own.
  =transform what you do into a craft...=
* What is Emacs... Really?
#+begin_quote
"... A magpie's nest of shiny things..."
 - Mastering Emacs

"... Thermonuclear word processor"
 - Neal Stephenson
#+end_quote
- Primarily an interpreter for the ~elisp~ Language (5% C code, 95% eLisp code)
- ~Local and Remote File Editor~
- ~Built-in Shell/Terminal~
- ~Org~ to-do, agenda, project planner, note-taking, programming
- ~Magit for Git management~
- Gnu Hyperbole reference package
- Symbolic calculator capable of all manner of mathematical calculation
- Music player & EPUB reader
- EGlot LSP integration for code completion, linting
* Why is Emacs unpopular?
- Poor support for Windows
  - While it installs fine, most tooling for emacs fails to run (Mastering Emacs).
    i.e. fine for only the basics, maybe enough to get a taste for it...
- High barrier to entry
  - Presupposes Linux user
- Low-usability for new users
- By default is ugly (agreed)
- elisp
  #+begin_quote
  "Emacs is 95% elisp and 5% C Code..."
   - Mickey Peterson _Mastering Emacs_.

  -----
  In other words, "Full disclosure, leveraging emacs _requires_ you to learn at least some elisp..."
  #+end_quote
* Why (not) Linux?
- Customizability
  _You're in total, absolute control in profound ways..._
- Vastness of scientific libraries and applications
  - R, Python, Octave, Sympy, entire distros specifically for your needs. (i.e. Skywave Linux)
- Hardware compatibility and helpful resources have never been as good as they are now.
** Practical examples
*** Package Management
#+begin_src bash :results output :exports both
apt show emacs | grep Version
#+end_src

#+RESULTS:
: Version: 1:30.1+1-6

#+begin_example
sudo apt install r-base
#+end_example

#+begin_quote
All of the instructions for /how/ to do a particular task can be laid out cleanly in your documentation, as so...
#+end_quote
*** Automating/notetaking of complex tasks
#+begin_quote
Following the DRY (don't repeat yourself) methodology:
it's best to automate routine things that are done a lot. I spent a lot of time running and re-running a series of tasks
to check and re-check my results.

Maybe there's a routine that we want to run a lot that'd sure be handy to have documented along with our project?

---

Here, org babel and tangle (with permission options) can be used to send scripts straight to a user's directory.
Potentially very handy if you're on a team and the one responsible for documention how to do compelx tasks...
#+end_quote

#+begin_src bash :results output silent :tangle ~/.local/bin/temp-handy-script :tangle-mode (identity #o755)
#!/bin/zsh
echo -e "This is my handy bash...\n\n"
ls -lhtr ~
echo -e "\n\nI listed what's in your home dir..."
#+end_src

[[https://orgmode.org/manual/Extracting-Source-Code.html][Link to Org tangle documentation]]

#+begin_quote
~IDEA:~

Scripts are wonderful, but they can get cumbersome and clumsy if they're not documented. A setup like this ensures
your scripts are well-documented, yet the context for what it does doesn't /need/ to spill over into the script itself...
#+end_quote

*** Configure the working directory for a project:
  #+begin_example
  mkdir -p plots/general                          # to store plots...
  mkdir -p plots/waveforms/{initial,denoised}     # to store initial waveforms
  mkdir -p plots/waveforms/anf                    # .. for notch filtered audio
  mkdir -p plots/spectrograms/{initial,denoised}  # to store initial spectrograms
  mkdir -p plots/spectrograms/anf                 # .. for anf files
  mkdir -p R                                      # to store tangled functions:
  mkdir -p csv/                                   # to store generated CSVs.
  mkdir -p out/{anf,bworth}                       # to store generated wavs
  #+end_example
* Basic emacs
