workshop-presentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-12 Mon 17:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Matthew Younger" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/code-copy.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc3e7381">1. Why use FOSS?</a></li>
<li><a href="#org895226b">2. What is Emacs&#x2026; Really?</a></li>
<li><a href="#orgc1ce55b">3. Why is Emacs unpopular?</a></li>
<li><a href="#org1240e99">4. Why (not) Linux?</a>
<ul>
<li><a href="#orga80ad50">4.1. Practical examples</a>
<ul>
<li><a href="#orgacbae56">4.1.1. Package Management</a></li>
<li><a href="#orgc8392eb">4.1.2. Automating/notetaking of complex tasks</a></li>
<li><a href="#org7b42293">4.1.3. Configure the working directory for a project:</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4a3d78e">5. Basic emacs</a>
<ul>
<li><a href="#orga57d6f4">5.1. Day 1 plan (What I wish I&rsquo;d have known)</a></li>
<li><a href="#orgb73e454">5.2. Learning the terminology</a>
<ul>
<li><a href="#orgce91732">5.2.1. Theory of Movement</a></li>
<li><a href="#orgf398814">5.2.2. Modes</a></li>
<li><a href="#org4590bcc">5.2.3. Copying/pasting text</a></li>
<li><a href="#org02b7642">5.2.4. Moving around</a></li>
</ul>
</li>
<li><a href="#org55244b0">5.3. Much-needed terminal upgrade</a></li>
<li><a href="#org2325d8d">5.4. Doom Emacs</a></li>
<li><a href="#orgcb25fce">5.5. Links to More Tips</a></li>
</ul>
</li>
<li><a href="#orgec0a051">6. Advanced Tools</a></li>
<li><a href="#org3d0cbdd">7. Practical Intro to Elisp</a>
<ul>
<li><a href="#org761198c">7.1. Change to a light theme:</a></li>
<li><a href="#orgf988a76">7.2. Enlarge text:</a></li>
<li><a href="#orgb726a22">7.3. Putting it together into a function:</a></li>
</ul>
</li>
<li><a href="#org88bd744">8. Org Mode</a>
<ul>
<li><a href="#org6771e5d">8.1. What is it?</a></li>
<li><a href="#orgd254a86">8.2. Polyglot (literate) Programming</a></li>
<li><a href="#org97ee865">8.3. Sharing with others (exporting)</a>
<ul>
<li><a href="#orgf5a508f">8.3.1. Exporting to HTML (best)</a></li>
<li><a href="#orgf668419">8.3.2. Ox-exporter</a></li>
</ul>
</li>
<li><a href="#orga3208d8">8.4. Babel</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc3e7381" class="outline-2">
<h2 id="orgc3e7381"><span class="section-number-2">1.</span> Why use FOSS?</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Avoid proprietary &ldquo;black box&rdquo; tools.
Transparency</li>
<li>Power of Plaintext over proprietary tools
Accessible long-term, available to more users, no lock-in.</li>
<li>Everything in one place
<ol class="org-ol">
<li>Editor</li>
<li>File browser/manager</li>
<li>Programming notebooks</li>
<li>Markdown, TeX docs</li>
<li>Remote file editing for my server via TRAMP</li>
<li>To-Do lists, calendar</li>
<li>Easy exportability of files to .html, .pdf, etc.</li>
</ol></li>
<li>Hardware longevity
Almost everyone has old PC&rsquo;s sitting around, which are great for Linux.
You&rsquo;ll be surprised how well it runs on so little vs proprietary stuff.
My PC is 5+ years old, runs great on RPi&rsquo;s also.</li>
<li>Malleable software
Modify to your heart&rsquo;s content or build your own.
<code>transform what you do into a craft...</code></li>
</ul>
</div>
</div>
<div id="outline-container-org895226b" class="outline-2">
<h2 id="org895226b"><span class="section-number-2">2.</span> What is Emacs&#x2026; Really?</h2>
<div class="outline-text-2" id="text-2">
<blockquote>
<p>
&ldquo;&#x2026; A magpie&rsquo;s nest of shiny things&#x2026;&rdquo;
</p>
<ul class="org-ul">
<li>Mastering Emacs</li>
</ul>

<p>
&ldquo;&#x2026; Thermonuclear word processor&rdquo;
</p>
<ul class="org-ul">
<li>Neal Stephenson</li>
</ul>
</blockquote>
<ul class="org-ul">
<li>Primarily an interpreter for the <code>elisp</code> Language (5% C code, 95% eLisp code)</li>
<li><code>Local and Remote File Editor</code></li>
<li><code>Built-in Shell/Terminal</code></li>
<li><code>Org</code> to-do, agenda, project planner, note-taking, programming</li>
<li><code>Magit for Git management</code></li>
<li>Gnu Hyperbole reference package</li>
<li>Symbolic calculator capable of all manner of mathematical calculation</li>
<li>Music player &amp; EPUB reader</li>
<li>EGlot LSP integration for code completion, linting</li>
</ul>
</div>
</div>
<div id="outline-container-orgc1ce55b" class="outline-2">
<h2 id="orgc1ce55b"><span class="section-number-2">3.</span> Why is Emacs unpopular?</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Poor support for Windows
<ul class="org-ul">
<li>While it installs fine, most tooling for emacs fails to run (Mastering Emacs).
i.e. fine for only the basics, maybe enough to get a taste for it&#x2026;</li>
</ul></li>
<li>High barrier to entry
<ul class="org-ul">
<li>Presupposes Linux user</li>
</ul></li>
<li>Low-usability for new users</li>
<li>By default is ugly (agreed)</li>
<li><p>
elisp
</p>
<blockquote>
<p>
&ldquo;Emacs is 95% elisp and 5% C Code&#x2026;&rdquo;
</p>
<ul class="org-ul">
<li>Mickey Peterson <span class="underline">Mastering Emacs</span>.</li>
</ul>

<hr />
<p>
In other words, &ldquo;Full disclosure, leveraging emacs <span class="underline">requires</span> you to learn at least some elisp&#x2026;&rdquo;
</p>
</blockquote></li>
</ul>
</div>
</div>
<div id="outline-container-org1240e99" class="outline-2">
<h2 id="org1240e99"><span class="section-number-2">4.</span> Why (not) Linux?</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Customizability
<span class="underline">You&rsquo;re in total, absolute control in profound ways&#x2026;</span></li>
<li>Vastness of scientific libraries and applications
<ul class="org-ul">
<li>R, Python, Octave, Sympy, entire distros specifically for your needs. (i.e. Skywave Linux)</li>
</ul></li>
<li>Hardware compatibility and helpful resources have never been as good as they are now.</li>
</ul>
</div>
<div id="outline-container-orga80ad50" class="outline-3">
<h3 id="orga80ad50"><span class="section-number-3">4.1.</span> Practical examples</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orgacbae56" class="outline-4">
<h4 id="orgacbae56"><span class="section-number-4">4.1.1.</span> Package Management</h4>
<div class="outline-text-4" id="text-4-1-1">
<div class="org-src-container">
<pre class="src src-bash">apt show emacs | <span style="color: #ECBE7B;">grep</span> Version
</pre>
</div>

<pre class="example" id="org58c68fc">
sudo apt install r-base
</pre>

<blockquote>
<p>
All of the instructions for <i>how</i> to do a particular task can be laid out cleanly in your documentation, as so&#x2026;
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgc8392eb" class="outline-4">
<h4 id="orgc8392eb"><span class="section-number-4">4.1.2.</span> Automating/notetaking of complex tasks</h4>
<div class="outline-text-4" id="text-4-1-2">
<blockquote>
<p>
Following the DRY (don&rsquo;t repeat yourself) methodology:
it&rsquo;s best to automate routine things that are done a lot. I spent a lot of time running and re-running a series of tasks
to check and re-check my results.
</p>

<p>
Maybe there&rsquo;s a routine that we want to run a lot that&rsquo;d sure be handy to have documented along with our project?
</p>

<p>
&#x2014;
</p>

<p>
Here, org babel and tangle (with permission options) can be used to send scripts straight to a user&rsquo;s directory.
Potentially very handy if you&rsquo;re on a team and the one responsible for documention how to do compelx tasks&#x2026;
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #5B6268;">#</span><span style="color: #5B6268;">!/bin/</span><span style="color: #51afef;">zsh</span><span style="color: #5B6268;">
</span><span style="color: #ECBE7B;">echo</span> -e <span style="color: #98be65;">"This is my handy bash...\n\n"</span>
<span style="color: #ECBE7B;">ls</span> -lhtr ~
<span style="color: #ECBE7B;">echo</span> -e <span style="color: #98be65;">"\n\nI listed what's in your home dir..."</span>
</pre>
</div>

<p>
<a href="https://orgmode.org/manual/Extracting-Source-Code.html">Link to Org tangle documentation</a>
</p>

<blockquote>
<p>
<code>IDEA:</code>
</p>

<p>
Scripts are wonderful, but they can get cumbersome and clumsy if they&rsquo;re not documented. A setup like this ensures
your scripts are well-documented, yet the context for what it does doesn&rsquo;t <i>need</i> to spill over into the script itself&#x2026;
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org7b42293" class="outline-4">
<h4 id="org7b42293"><span class="section-number-4">4.1.3.</span> Configure the working directory for a project:</h4>
<div class="outline-text-4" id="text-4-1-3">
<pre class="example" id="orgc8d17db">
  mkdir -p plots/general                          # to store plots...
  mkdir -p plots/waveforms/{initial,denoised}     # to store initial waveforms
  mkdir -p plots/waveforms/anf                    # .. for notch filtered audio
  mkdir -p plots/spectrograms/{initial,denoised}  # to store initial spectrograms
  mkdir -p plots/spectrograms/anf                 # .. for anf files
  mkdir -p R                                      # to store tangled functions:
  mkdir -p csv/                                   # to store generated CSVs.
  mkdir -p out/{anf,bworth}                       # to store generated wavs
</pre>
</div>
</div>
</div>
</div>
