workshop-presentation.org
** Day 1 plan (What I wish I'd have known)
  "Learn how to help yourself."
  #+begin_quote
  "Self-documenting means that at any time you can use special commands, known as help commands, to find out what your options are, or to find out what any command does, or to find all the commands that pertain to a given topic."
  - Emacs Docs

  You'll spend several days/weeks learning to navigate and remember where things are by using =C-h=...
  As you use it, you'll learn where the /things you use and depend on/ are. (I don't think anyone knows it all...)
  This underscores the importance of first learning where to find what you need. Remembering it will come automatically in time.

  Also... =<SPC> h-b-b= to discover all the current bindings (for wherever you are)
  #+end_quote
** Learning the terminology
*** Theory of Movement
1) Frame (windows)
   - Window (frames)
     #+begin_quote
     Splitting windows:
     Horizontally: =<SPC>-w-v=
     Vertically: =<SPC-w-s=

     TIP: Most of moving around /between/ windows is the same as normal VIM move commands, simply prefixed with a =<SPC>-w= for window commands.
     i.e.
     Move cursor up one window
     =<SPC>-w-k=
     Move cursor down one window
     =<SPC>-w-j=
     #+end_quote
2) Workspaces =<SPC> <TAB>=
   - Potentially _more_ useful than frames is workspaces. Simply teleport over to your other tasks...
*** Modes
1) Major mode - behavior (i.e. Org, editing a .py file, etc)
2) Minor mode - add-ons (spell-check, formatting, etc)
   - Particularly useful, I like to turn on spellcheck /lastly,/ after I've done the bulk of my writing.
     I consider this a feature!
*** Copying/pasting text
#+begin_quote
Emacs gives you this wonderful revolving door called the /kill ring/, which keeps (for the session) a continual record of what you copied (inside emacs).
Text you remove by "killing" it isn't truly gone, it gets _moved_ to the kill ring and can be found handily searched at any time:
=<
#+end_quote
1) "Killing" text
   - "Copy"/save to kill ring =M-w=
   - Save _entire line_ to kill ring =<deleteline>=
     (CTRL+SHIFT+BACKSPACE)
   - "Cut"/kill region =C-wxy=
   - Kill region to end of line =D=
*** Moving around
- Evil Snipe
  Snipe and Vim shortcuts are amazingly efficient...
  #+begin_quote
  (From move mode, navigate to the line you want to edit on...)
  To match on two characters FORWARD: =s {type 2 chars to match}=
  (subsequent s's move foreward...)

  Example:
  I'll have some Spam Eggs Spam


  To match on two characters REVERSE: =S {type 2 chars to match}=
  Spam Eggs Spam some have I'll

  (Caveat: subsequent REVERSE serches are done with =s=, not =S=)
  #+end_quote

- Learning VIM bindings:
  #+begin_quote
  To move up, =k=
  To move down, =j=
  To move right, =l=
  To move left, =h=

  Foreward one word =w=
  Backward one word =b=
  (also works with delete... =d=)

  Comment: the keybindings don't make sense as abbreviations, but by where they're at on the keyboard...

  Replacement mode (from movement mode) =R=

  Example:
  You'll never replace me!

  Backwards and forwards by a sentence...
  =(= or =)=
  I am a sentence. I'm another. I'm the final sentence. But wait, there's more...

  Coincidentally, these also work nicely with =d= for delete
  i.e. =d(= deletes the preveious sentence

  Join two lines: =J=
  line one
  Line two
  #+end_quote

- Setting Marks
  #+begin_quote
  markers can be really powerful. Think of them like bookmarks.
  (from evil mode) set a mark somewhere in the file. =m {some character on kbd}= (hint, m is a good, fast option...)
  Navigate away, mark again *(different character)*

  Goto a marker: =` {some character used prev.}=
  TIP: It seems evil always marks the last inserted position with the last mark (`) i.e. =``= always returns you to where you were last inserting.

  To me, this is almost as handy (maybe more-so for focusing?) than split-pane mode.
  #+end_quote
** Much-needed terminal upgrade
Unfortunately, the default terminal(s) that Emacs and Doom ship with are /awful./ Fix that right away...

And in your Doom Emacs ~init.el~ file:
#+begin_example elisp
;;init.el

:term
;;eshell            ; the elisp shell that works everywhere
;;shell             ; simple shell REPL for Emacs
;;term              ; basic terminal emulator for Emacs
vterm             ; the best terminal emulation in Emacs
#+end_example

While you're here, you might also enable additional [[init.el_lang][language support]], which Doom makes easy...

#+begin_example basho
sudo apt install libvterm libvterm-dev libtool
#+end_example


** Doom Emacs
- Curated defaults and "sane" settings, rather than fight generic GNU defaults /and/ learn simultaneously.
  - [[https://github.com/minad/corfu][Corfu]]
    Text completion back-end (pop-down for spelling, etc)
  - [[https://github.com/magit/magit][Magit]]
    Amazing Git integration for Emacs. Worthy of its own tutorial...
  - [[https://github.com/bbatsov/projectile][Projectile]]
  - [[https://elpa.gnu.org/packages/which-key.html][Which Key]]
    Your gateway to finding the shortcuts you can never remember.
    "Level II =C-h="
  - [[https://github.com/Alexander-Miller/treemacs][Treemacs]]
  - [[https://github.com/flycheck/flycheck][Flycheck]]
    Needs to be enabled in init.el, then run doom sync.
  - [[https://github.com/doomemacs/themes?tab=readme-ov-file#theme-list][Many themes]]
  - [[https://github.com/emacs-evil/evil][Evil Mode]]
- Install packages directly from GitHub (if desired)
- [[https://github.com/emacs-evil/evil][emulation Vim]]
  (Extensible VI Layer)
  #+begin_quote
  As a Linux guru and Systems Engineer, I highly recommend learning vi anyway, since it's the de-facto standard on every server implementation of Linux. You can count on Vi being present on the machine.
  #+end_quote
- LSP integration
- =doom doctor= assists with possible configuration issues
- Designed with repeatability in mind (i.e. backup to your own Git repo)
