workshop-presentation.html
<div id="outline-container-org4a3d78e" class="outline-2">
<h2 id="org4a3d78e"><span class="section-number-2">5.</span> Basic emacs</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orga57d6f4" class="outline-3">
<h3 id="orga57d6f4"><span class="section-number-3">5.1.</span> Day 1 plan (What I wish I&rsquo;d have known)</h3>
<div class="outline-text-3" id="text-5-1">
<p>
&ldquo;Learn how to help yourself.&rdquo;
</p>
<blockquote>
<p>
&ldquo;Self-documenting means that at any time you can use special commands, known as help commands, to find out what your options are, or to find out what any command does, or to find all the commands that pertain to a given topic.&rdquo;
</p>
<ul class="org-ul">
<li>Emacs Docs</li>
</ul>

<p>
You&rsquo;ll spend several days/weeks learning to navigate and remember where things are by using <code>C-h</code>&#x2026;
As you use it, you&rsquo;ll learn where the <i>things you use and depend on</i> are. (I don&rsquo;t think anyone knows it all&#x2026;)
This underscores the importance of first learning where to find what you need. Remembering it will come automatically in time.
</p>

<p>
Also&#x2026; <code>&lt;SPC&gt; h-b-b</code> to discover all the current bindings (for wherever you are)
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgb73e454" class="outline-3">
<h3 id="orgb73e454"><span class="section-number-3">5.2.</span> Learning the terminology</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-orgce91732" class="outline-4">
<h4 id="orgce91732"><span class="section-number-4">5.2.1.</span> Theory of Movement</h4>
<div class="outline-text-4" id="text-5-2-1">
<ol class="org-ol">
<li>Frame (windows)
<ul class="org-ul">
<li><p>
Window (frames)
</p>
<blockquote>
<p>
Splitting windows:
Horizontally: <code>&lt;SPC&gt;-w-v</code>
Vertically: <code>&lt;SPC-w-s</code>
</p>

<p>
TIP: Most of moving around <i>between</i> windows is the same as normal VIM move commands, simply prefixed with a <code>&lt;SPC&gt;-w</code> for window commands.
i.e.
Move cursor up one window
<code>&lt;SPC&gt;-w-k</code>
Move cursor down one window
<code>&lt;SPC&gt;-w-j</code>
</p>
</blockquote></li>
</ul></li>
<li>Workspaces <code>&lt;SPC&gt; &lt;TAB&gt;</code>
<ul class="org-ul">
<li>Potentially <span class="underline">more</span> useful than frames is workspaces. Simply teleport over to your other tasks&#x2026;</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-orgf398814" class="outline-4">
<h4 id="orgf398814"><span class="section-number-4">5.2.2.</span> Modes</h4>
<div class="outline-text-4" id="text-5-2-2">
<ol class="org-ol">
<li>Major mode - behavior (i.e. Org, editing a .py file, etc)</li>
<li>Minor mode - add-ons (spell-check, formatting, etc)
<ul class="org-ul">
<li>Particularly useful, I like to turn on spellcheck <i>lastly,</i> after I&rsquo;ve done the bulk of my writing.
I consider this a feature!</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org4590bcc" class="outline-4">
<h4 id="org4590bcc"><span class="section-number-4">5.2.3.</span> Copying/pasting text</h4>
<div class="outline-text-4" id="text-5-2-3">
<blockquote>
<p>
Emacs gives you this wonderful revolving door called the <i>kill ring</i>, which keeps (for the session) a continual record of what you copied (inside emacs).
Text you remove by &ldquo;killing&rdquo; it isn&rsquo;t truly gone, it gets <span class="underline">moved</span> to the kill ring and can be found handily searched at any time:
=&lt;
</p>
</blockquote>
<ol class="org-ol">
<li>&ldquo;Killing&rdquo; text
<ul class="org-ul">
<li>&ldquo;Copy&rdquo;/save to kill ring <code>M-w</code></li>
<li>Save <span class="underline">entire line</span> to kill ring <code>&lt;deleteline&gt;</code>
(CTRL+SHIFT+BACKSPACE)</li>
<li>&ldquo;Cut&rdquo;/kill region <code>C-wxy</code></li>
<li>Kill region to end of line <code>D</code></li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org02b7642" class="outline-4">
<h4 id="org02b7642"><span class="section-number-4">5.2.4.</span> Moving around</h4>
<div class="outline-text-4" id="text-5-2-4">
<ul class="org-ul">
<li><p>
Evil Snipe
Snipe and Vim shortcuts are amazingly efficient&#x2026;
</p>
<blockquote>
<p>
(From move mode, navigate to the line you want to edit on&#x2026;)
To match on two characters FORWARD: <code>s {type 2 chars to match}</code>
(subsequent s&rsquo;s move foreward&#x2026;)
</p>

<p>
Example:
I&rsquo;ll have some Spam Eggs Spam
</p>


<p>
To match on two characters REVERSE: <code>S {type 2 chars to match}</code>
Spam Eggs Spam some have I&rsquo;ll
</p>

<p>
(Caveat: subsequent REVERSE serches are done with <code>s</code>, not <code>S</code>)
</p>
</blockquote></li>

<li><p>
Learning VIM bindings:
</p>
<blockquote>
<p>
To move up, <code>k</code>
To move down, <code>j</code>
To move right, <code>l</code>
To move left, <code>h</code>
</p>

<p>
Foreward one word <code>w</code>
Backward one word <code>b</code>
(also works with delete&#x2026; <code>d</code>)
</p>

<p>
Comment: the keybindings don&rsquo;t make sense as abbreviations, but by where they&rsquo;re at on the keyboard&#x2026;
</p>

<p>
Replacement mode (from movement mode) <code>R</code>
</p>

<p>
Example:
You&rsquo;ll never replace me!
</p>

<p>
Backwards and forwards by a sentence&#x2026;
<code>(</code> or <code>)</code>
I am a sentence. I&rsquo;m another. I&rsquo;m the final sentence. But wait, there&rsquo;s more&#x2026;
</p>

<p>
Coincidentally, these also work nicely with <code>d</code> for delete
i.e. <code>d(</code> deletes the preveious sentence
</p>

<p>
Join two lines: <code>J</code>
line one
Line two
</p>
</blockquote></li>

<li><p>
Setting Marks
</p>
<blockquote>
<p>
markers can be really powerful. Think of them like bookmarks.
(from evil mode) set a mark somewhere in the file. <code>m {some character on kbd}</code> (hint, m is a good, fast option&#x2026;)
Navigate away, mark again <b>(different character)</b>
</p>

<p>
Goto a marker: <code>` {some character used prev.}</code>
TIP: It seems evil always marks the last inserted position with the last mark (`) i.e. <code>``</code> always returns you to where you were last inserting.
</p>

<p>
To me, this is almost as handy (maybe more-so for focusing?) than split-pane mode.
</p>
</blockquote></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org55244b0" class="outline-3">
<h3 id="org55244b0"><span class="section-number-3">5.3.</span> Much-needed terminal upgrade</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Unfortunately, the default terminal(s) that Emacs and Doom ship with are <i>awful.</i> Fix that right away&#x2026;
</p>

<p>
And in your Doom Emacs <code>init.el</code> file:
</p>
<pre class="example" id="orgb76a627">
;;init.el

:term
;;eshell            ; the elisp shell that works everywhere
;;shell             ; simple shell REPL for Emacs
;;term              ; basic terminal emulator for Emacs
vterm             ; the best terminal emulation in Emacs
</pre>

<p>
While you&rsquo;re here, you might also enable additional <a href="#org983cd71">language support</a>, which Doom makes easy&#x2026;
</p>

<pre class="example" id="org0d98218">
sudo apt install libvterm libvterm-dev libtool
</pre>
</div>
</div>
<div id="outline-container-org2325d8d" class="outline-3">
<h3 id="org2325d8d"><span class="section-number-3">5.4.</span> Doom Emacs</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li>Curated defaults and &ldquo;sane&rdquo; settings, rather than fight generic GNU defaults <i>and</i> learn simultaneously.
<ul class="org-ul">
<li><a href="https://github.com/minad/corfu">Corfu</a>
Text completion back-end (pop-down for spelling, etc)</li>
<li><a href="https://github.com/magit/magit">Magit</a>
Amazing Git integration for Emacs. Worthy of its own tutorial&#x2026;</li>
<li><a href="https://github.com/bbatsov/projectile">Projectile</a></li>
<li><a href="https://elpa.gnu.org/packages/which-key.html">Which Key</a>
Your gateway to finding the shortcuts you can never remember.
&ldquo;Level II <code>C-h</code>&rdquo;</li>
<li><a href="https://github.com/Alexander-Miller/treemacs">Treemacs</a></li>
<li><a href="https://github.com/flycheck/flycheck">Flycheck</a>
Needs to be enabled in init.el, then run doom sync.</li>
<li><a href="https://github.com/doomemacs/themes?tab=readme-ov-file#theme-list">Many themes</a></li>
<li><a href="https://github.com/emacs-evil/evil">Evil Mode</a></li>
</ul></li>
<li>Install packages directly from GitHub (if desired)</li>
<li><p>
<a href="https://github.com/emacs-evil/evil">emulation Vim</a>
(Extensible VI Layer)
</p>
<blockquote>
<p>
As a Linux guru and Systems Engineer, I highly recommend learning vi anyway, since it&rsquo;s the de-facto standard on every server implementation of Linux. You can count on Vi being present on the machine.
</p>
</blockquote></li>
<li>LSP integration</li>
<li><code>doom doctor</code> assists with possible configuration issues</li>
<li>Designed with repeatability in mind (i.e. backup to your own Git repo)</li>
</ul>
</div>
</div>
