workshop-presentation.org
** Links to More Tips
- [[https://yusbk.github.io/2021/04/27/doom-emacs-tips/][Doom Emacs Tips - yusbk@GitHub]]
- [[https://www.masteringemacs.org/][Mastering Emacs]]- [[https://www.masteringemacs.org/][Mastering Emacs (PDF Book)]]
- [[file:remapping-ctrl.org][Avoiding Emacs Pinky]]
- [[https://www.youtube.com/watch?v=w3krYEeqnyk][Conquering Kubernetes with Emacs + Org Mode]]
- [[https://www.youtube.com/watch?v=pqLSPo5k70c][Writing a Book in Org Mode]]
* Advanced Tools
Things I likely didn't have time to fit into an hour, but could also be interesting...
- Using [[file:polyglot-example.org::Python Random Forest Model][uv]] for Python dependencies and virtual environments
- Using [[file:polyglot-example.org::Environment Inspection][remotes]] for R to install packages from GitHub directly
- Increasing resolution of R graphics in [[file:polyglot-example.org][Org's header]]
* Practical Intro to Elisp
** Change to a light theme:
#+begin_quote
I was asked to use large text and /not/ use dark backgrounds when presenting, because of smartphones.
What a great example for a practical elisp example...

How do we do this?  I have no example, but luckily, *emacs is self-documenting...*

=<SPC> h t= shows that =consult-theme= is responsible for changing THEME... Ok...
#+end_quote

#+begin_src elisp :noeval
;; Cool, so that wasn't bad...
(consult-theme 'doom-flatwhite)
#+end_src

** Enlarge text:
#+BEGIN_quote
How is this done? Well, I know the scroll wheel enlarges text
Let's find out how to automate that...
=<SPC> h k <CTRL> <Scroll>=  Signature

-------

(mouse-wheel-text-scale EVENT)

Documentation
Adjust font size of the default face according to EVENT.

See also text-scale-adjust.

*This wasn't that helpful*
-------

=<SPC> := "text..."

Ah, text-scale-set  <-- Let's fiddle with this...

=<SPC> ;= (text-scale-set 5) <-- HERE WE ARE...
#+end_quote

Let's put it into some elisp code...
#+begin_src elisp :noeval
(text-scale-set 4)
#+end_src

#+begin_quote
However... We'll see that switching to a different buffer has old text the same default size.  Hm...

=<SPC> := big-font...

---
Documentation
Globally resizes your fonts for streams, screen-sharing or presentations.

Uses doom-big-font if its set, otherwise uses doom-font (falling back to
your system font).

Also resizees doom-variable-pitch-font and doom-serif-font.

This is a global minor mode.  If called interactively, toggle the
Doom-BIG-Font mode mode.  If the prefix argument is positive, enable
the mode, and if it is zero or negative, disable the mode.

If called from Lisp, toggle the mode if ARG is toggle.  Enable the
mode if ARG is nil, omitted, or is a positive number.  Disable the mode
if ARG is a negative number.
---

This looks better...
Let's see how it works...
=<SPC> h f doom-big-font-mode=
Reveals that it seems to operate based on doom-adjust-font-size...
So, we can set that...
#+end_quote

#+begin_src elisp
(doom-adjust-font-size 5)
#+end_src

#+begin_src elisp :noeval
;; This gets us back to square one...
(doom/reset-font-size)
#+end_src

** Putting it together into a function:
#+PROPERTY: header-args:elisp :results silent
#+begin_src elisp
(defun +presentation-mode (&optional arg)
  "Custom function to ready Emacs for presenting. Enables if ARG is non-nil, else disables."
  (if arg
      (progn
        (message "Enabling presentation mode!")
        (consult-theme 'doom-flatwhite)
        (doom-adjust-font-size 4))
    (progn
      (message "Disabling presentation mode!")
      (doom/reset-font-size)
      (consult-theme 'doom-one))))
#+end_src

#+begin_quote
And, we can try calling it:
=<SPC> ; "(+presentation-mode t)"=

Basic functionality achieved...

Maybe there are some other things we'd like to have it do, i.e. clean up our == ~~ ** __ stuff... with org-pretty-mode?
#+end_quote

#+begin_src elisp :results silent
(defun +presentation-mode (&optional arg)
  "Custom function to ready Emacs for presenting. Enables if ARG is non-nil, else disables."
  (if arg
      (progn
        (message "Enabling presentation mode!")
        (consult-theme 'doom-flatwhite)  ;;Load a more readable theme
        (doom-adjust-font-size 4) ;; Adjust font size for smartphones
        (+org-pretty-mode) ;; Formatting niceities
        (org-indent-mode -1))
    (progn
      (message "Disabling presentation mode!")
      (doom/reset-font-size)
      (consult-theme 'doom-one)
      (+org-pretty-mode -1)
      (org-indent-mode))
      )))
#+end_src
* Org Mode
