workshop-presentation.html
<div id="outline-container-orgcb25fce" class="outline-3">
<h3 id="orgcb25fce"><span class="section-number-3">5.5.</span> Links to More Tips</h3>
<div class="outline-text-3" id="text-5-5">
<ul class="org-ul">
<li><a href="https://yusbk.github.io/2021/04/27/doom-emacs-tips/">Doom Emacs Tips - yusbk@GitHub</a></li>
<li><a href="https://www.masteringemacs.org/">Mastering Emacs</a>- <a href="https://www.masteringemacs.org/">Mastering Emacs (PDF Book)</a></li>
<li><a href="remapping-ctrl.html">Avoiding Emacs Pinky</a></li>
<li><a href="https://www.youtube.com/watch?v=w3krYEeqnyk">Conquering Kubernetes with Emacs + Org Mode</a></li>
<li><a href="https://www.youtube.com/watch?v=pqLSPo5k70c">Writing a Book in Org Mode</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgec0a051" class="outline-2">
<h2 id="orgec0a051"><span class="section-number-2">6.</span> Advanced Tools</h2>
<div class="outline-text-2" id="text-6">
<p>
Things I likely didn&rsquo;t have time to fit into an hour, but could also be interesting&#x2026;
</p>
<ul class="org-ul">
<li>Using <a href="polyglot-example.html#MissingReference">uv</a> for Python dependencies and virtual environments</li>
<li>Using <a href="polyglot-example.html#MissingReference">remotes</a> for R to install packages from GitHub directly</li>
<li>Increasing resolution of R graphics in <a href="polyglot-example.html">Org&rsquo;s header</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3d0cbdd" class="outline-2">
<h2 id="org3d0cbdd"><span class="section-number-2">7.</span> Practical Intro to Elisp</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org761198c" class="outline-3">
<h3 id="org761198c"><span class="section-number-3">7.1.</span> Change to a light theme:</h3>
<div class="outline-text-3" id="text-7-1">
<blockquote>
<p>
I was asked to use large text and <i>not</i> use dark backgrounds when presenting, because of smartphones.
What a great example for a practical elisp example&#x2026;
</p>

<p>
How do we do this?  I have no example, but luckily, <b>emacs is self-documenting&#x2026;</b>
</p>

<p>
<code>&lt;SPC&gt; h t</code> shows that <code>consult-theme</code> is responsible for changing THEME&#x2026; Ok&#x2026;
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Cool, so that wasn't bad...
</span>(<span style="color: #a9a1e1;">consult-theme</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">doom-flatwhite</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf988a76" class="outline-3">
<h3 id="orgf988a76"><span class="section-number-3">7.2.</span> Enlarge text:</h3>
<div class="outline-text-3" id="text-7-2">
<blockquote>
<p>
How is this done? Well, I know the scroll wheel enlarges text
Let&rsquo;s find out how to automate that&#x2026;
<code>&lt;SPC&gt; h k &lt;CTRL&gt; &lt;Scroll&gt;</code>  Signature
</p>

<hr />

<p>
(mouse-wheel-text-scale EVENT)
</p>

<p>
Documentation
Adjust font size of the default face according to EVENT.
</p>

<p>
See also text-scale-adjust.
</p>

<p>
<b>This wasn&rsquo;t that helpful</b>
</p>
<hr />

<p>
<code>&lt;SPC&gt; :</code> &ldquo;text&#x2026;&rdquo;
</p>

<p>
Ah, text-scale-set  &lt;&#x2013; Let&rsquo;s fiddle with this&#x2026;
</p>

<p>
<code>&lt;SPC&gt; ;</code> (text-scale-set 5) &lt;&#x2013; HERE WE ARE&#x2026;
</p>
</blockquote>

<p>
Let&rsquo;s put it into some elisp code&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a9a1e1;">text-scale-set</span> 4)
</pre>
</div>

<blockquote>
<p>
However&#x2026; We&rsquo;ll see that switching to a different buffer has old text the same default size.  Hm&#x2026;
</p>

<p>
<code>&lt;SPC&gt; :</code> big-font&#x2026;
</p>

<p>
&#x2014;
Documentation
Globally resizes your fonts for streams, screen-sharing or presentations.
</p>

<p>
Uses doom-big-font if its set, otherwise uses doom-font (falling back to
your system font).
</p>

<p>
Also resizees doom-variable-pitch-font and doom-serif-font.
</p>

<p>
This is a global minor mode.  If called interactively, toggle the
Doom-BIG-Font mode mode.  If the prefix argument is positive, enable
the mode, and if it is zero or negative, disable the mode.
</p>

<p>
If called from Lisp, toggle the mode if ARG is toggle.  Enable the
mode if ARG is nil, omitted, or is a positive number.  Disable the mode
if ARG is a negative number.
&#x2014;
</p>

<p>
This looks better&#x2026;
Let&rsquo;s see how it works&#x2026;
<code>&lt;SPC&gt; h f doom-big-font-mode</code>
Reveals that it seems to operate based on doom-adjust-font-size&#x2026;
So, we can set that&#x2026;
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #c678dd;">doom-adjust-font-size</span> 5)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">This gets us back to square one...
</span>(<span style="color: #c678dd;">doom/reset-font-size</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb726a22" class="outline-3">
<h3 id="orgb726a22"><span class="section-number-3">7.3.</span> Putting it together into a function:</h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">+presentation-mode</span> (<span style="color: #ECBE7B;">&amp;optional</span> arg)
  <span style="color: #83898d;">"Custom function to ready Emacs for presenting. Enables if ARG is non-nil, else disables."</span>
  (<span style="color: #51afef;">if</span> arg
      (<span style="color: #51afef;">progn</span>
        (<span style="color: #a9a1e1;">message</span> <span style="color: #98be65;">"Enabling presentation mode!"</span>)
        (<span style="color: #a9a1e1;">consult-theme</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">doom-flatwhite</span>)
        (<span style="color: #c678dd;">doom-adjust-font-size</span> 4))
    (<span style="color: #51afef;">progn</span>
      (<span style="color: #a9a1e1;">message</span> <span style="color: #98be65;">"Disabling presentation mode!"</span>)
      (<span style="color: #c678dd;">doom/reset-font-size</span>)
      (<span style="color: #a9a1e1;">consult-theme</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">doom-one</span>))))
</pre>
</div>

<blockquote>
<p>
And, we can try calling it:
<code>&lt;SPC&gt; ; "(+presentation-mode t)"</code>
</p>

<p>
Basic functionality achieved&#x2026;
</p>

<p>
Maybe there are some other things we&rsquo;d like to have it do, i.e. clean up our == ~~ ** __ stuff&#x2026; with org-pretty-mode?
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">+presentation-mode</span> (<span style="color: #ECBE7B;">&amp;optional</span> arg)
  <span style="color: #83898d;">"Custom function to ready Emacs for presenting. Enables if ARG is non-nil, else disables."</span>
  (<span style="color: #51afef;">if</span> arg
      (<span style="color: #51afef;">progn</span>
        (<span style="color: #a9a1e1;">message</span> <span style="color: #98be65;">"Enabling presentation mode!"</span>)
        (<span style="color: #a9a1e1;">consult-theme</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">doom-flatwhite</span>)  <span style="color: #5B6268;">;;</span><span style="color: #5B6268;">Load a more readable theme
</span>        (<span style="color: #c678dd;">doom-adjust-font-size</span> 4) <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Adjust font size for smartphones
</span>        (<span style="color: #dcaeea;">+org-pretty-mode</span>) <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Formatting niceities
</span>        (<span style="color: #dcaeea;">org-indent-mode</span> -1))
    (<span style="color: #51afef;">progn</span>
      (<span style="color: #a9a1e1;">message</span> <span style="color: #98be65;">"Disabling presentation mode!"</span>)
      (<span style="color: #c678dd;">doom/reset-font-size</span>)
      (<span style="color: #a9a1e1;">consult-theme</span> <span style="color: #51afef;">'</span><span style="color: #ECBE7B;">doom-one</span>)
      (<span style="color: #dcaeea;">+org-pretty-mode</span> -1)
      (<span style="color: #dcaeea;">org-indent-mode</span>))
      )))
</pre>
</div>
</div>
</div>
</div>
