workshop-presentation.org
** What is it?
- In an nutshell
  #+begin_quote
  Org mode is here to help you realize the _power of plaintext_ in document creation. It's a different philosophy that emphasizes storing your document's content *not* as encoded information in a proprietary format, such as ~.docx~, ~.pdf~, ~Google Sheets~, etc, but as simple text in a file.

  It's similar to, but also distinct from Markdown (although most of its features, Git(Hub) recognizes and works with). Org content is more dynamic and integrates well with other Emacs features (agendas, timestamping, etc), and is more of a living document than Markdown (which is basically static).

  Org mode has excellent exporting abilities, ~HTML~, ~TeX~, ~PDF~, and others (extensible with [[https://orgmode.org/worg/exporters/ox-overview.html][ox framework]])

  #+end_quote
- [[https://orgmode.org/orgguide.pdf][Official Quickstart Guide]]
- Emacs ~major mode~
  - Notes
  - Documents
  - Literate programming & computational notebooks
  - To-do lists
  - Project Planning
- [[https://www.labri.fr/perso/nrougier/GTD/index.html][GTD Guide]]
- [[https://orgmode.org/worg/org-tutorials/index.html][Worg - Inspiration for using...]]
  #+begin_quote
  The trouble seems to be finding /effective/ ways to use it. Suffice it to say, Org is useful from everything from task management to coding and publishing... Decide on /your/ use case for it and focus your efforts there. Patience...
  #+end_quote
- [[https://orgmode.org/tools.html][Mobile Compatibility]]
  #+begin_quote
  There are varrious tools to extend Org mode to Android and IOS, and to narrow it to a particular use case, if defaults are too broad for your liking.
  #+end_quote
** Polyglot (literate) Programming
- Definition:
  /"The practice of using multiple programming languages in a single project, system, or file, for the purpose of leveraging the strengths of each language for different tasks. This technique leverages the strengths of multiple programming languages and often yields greater efficiency in solving complex problems."/
- Live example
** Sharing with others (exporting)
*** Exporting to HTML (best)
- [[https://github.com/fniessen/org-html-themes][readtheorg theme]]
  #+begin_quote
  Link to the theme I used for this presentation...
  #+end_quote
*** Ox-exporter
- [[https://orgmode.org/worg/exporters/ox-overview.html][Link to available export formats]]
  - Presentations
    - Beamer
      De-facto standard for anything Mathematics related
    - deck.js
      More general slideshow format. Prettier...
    - HTML presentations
      I.e. this presentation. Great for multimodal web-oriented presentations.
  - Documentation
    - HTML
    - PDF
    - ODT (open office)
    - Markdown
  - Task Juggling
    - iCalendar
    - Task Juggler
  - LaTeX
    - Koma Scrittr?
  - man (Linux Man pages)
  - Freemind (mind mapping)
  - [[https://www.gnu.org/software/groff/][Groff]]
    GNU Typesetting system
** Babel
Setting up Babel correctly takes some tweaking...
First, head over to your =init.el= file and tune that for the languages and things you plan to use:
#+name: init.el_lang
#+begin_example elisp
;;init.el
;;Filtered for relevance...
:lang
...
emacs-lisp        ; drown in parentheses
ess               ; emacs speaks statistics
markdown          ; writing docs for people to ignore
nix               ; I hereby declare "nix geht mehr!"
org               ; organize your plain life in plain text
python            ; beautiful is better than ugly
sh                ; she sells {ba,z,fi}sh shells on the C xor
...
#+end_example

Check out [[https://org-babel.readthedocs.io/en/latest/][this handy guide]] for way more in-depth examples.
