workshop-presentation.html
<div id="outline-container-org88bd744" class="outline-2">
<h2 id="org88bd744"><span class="section-number-2">8.</span> Org Mode</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org6771e5d" class="outline-3">
<h3 id="org6771e5d"><span class="section-number-3">8.1.</span> What is it?</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li><p>
In an nutshell
</p>
<blockquote>
<p>
Org mode is here to help you realize the <span class="underline">power of plaintext</span> in document creation. It&rsquo;s a different philosophy that emphasizes storing your document&rsquo;s content <b>not</b> as encoded information in a proprietary format, such as <code>.docx</code>, <code>.pdf</code>, <code>Google Sheets</code>, etc, but as simple text in a file.
</p>

<p>
It&rsquo;s similar to, but also distinct from Markdown (although most of its features, Git(Hub) recognizes and works with). Org content is more dynamic and integrates well with other Emacs features (agendas, timestamping, etc), and is more of a living document than Markdown (which is basically static).
</p>

<p>
Org mode has excellent exporting abilities, <code>HTML</code>, <code>TeX</code>, <code>PDF</code>, and others (extensible with <a href="https://orgmode.org/worg/exporters/ox-overview.html">ox framework</a>)
</p>
</blockquote></li>
<li><a href="https://orgmode.org/orgguide.pdf">Official Quickstart Guide</a></li>
<li>Emacs <code>major mode</code>
<ul class="org-ul">
<li>Notes</li>
<li>Documents</li>
<li>Literate programming &amp; computational notebooks</li>
<li>To-do lists</li>
<li>Project Planning</li>
</ul></li>
<li><a href="https://www.labri.fr/perso/nrougier/GTD/index.html">GTD Guide</a></li>
<li><p>
<a href="https://orgmode.org/worg/org-tutorials/index.html">Worg - Inspiration for using&#x2026;</a>
</p>
<blockquote>
<p>
The trouble seems to be finding <i>effective</i> ways to use it. Suffice it to say, Org is useful from everything from task management to coding and publishing&#x2026; Decide on <i>your</i> use case for it and focus your efforts there. Patience&#x2026;
</p>
</blockquote></li>
<li><p>
<a href="https://orgmode.org/tools.html">Mobile Compatibility</a>
</p>
<blockquote>
<p>
There are varrious tools to extend Org mode to Android and IOS, and to narrow it to a particular use case, if defaults are too broad for your liking.
</p>
</blockquote></li>
</ul>
</div>
</div>
<div id="outline-container-orgd254a86" class="outline-3">
<h3 id="orgd254a86"><span class="section-number-3">8.2.</span> Polyglot (literate) Programming</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>Definition:
<i>&ldquo;The practice of using multiple programming languages in a single project, system, or file, for the purpose of leveraging the strengths of each language for different tasks. This technique leverages the strengths of multiple programming languages and often yields greater efficiency in solving complex problems.&rdquo;</i></li>
<li>Live example</li>
</ul>
</div>
</div>
<div id="outline-container-org97ee865" class="outline-3">
<h3 id="org97ee865"><span class="section-number-3">8.3.</span> Sharing with others (exporting)</h3>
<div class="outline-text-3" id="text-8-3">
</div>
<div id="outline-container-orgf5a508f" class="outline-4">
<h4 id="orgf5a508f"><span class="section-number-4">8.3.1.</span> Exporting to HTML (best)</h4>
<div class="outline-text-4" id="text-8-3-1">
<ul class="org-ul">
<li><p>
<a href="https://github.com/fniessen/org-html-themes">readtheorg theme</a>
</p>
<blockquote>
<p>
Link to the theme I used for this presentation&#x2026;
</p>
</blockquote></li>
</ul>
</div>
</div>
<div id="outline-container-orgf668419" class="outline-4">
<h4 id="orgf668419"><span class="section-number-4">8.3.2.</span> Ox-exporter</h4>
<div class="outline-text-4" id="text-8-3-2">
<ul class="org-ul">
<li><a href="https://orgmode.org/worg/exporters/ox-overview.html">Link to available export formats</a>
<ul class="org-ul">
<li>Presentations
<ul class="org-ul">
<li>Beamer
De-facto standard for anything Mathematics related</li>
<li>deck.js
More general slideshow format. Prettier&#x2026;</li>
<li>HTML presentations
I.e. this presentation. Great for multimodal web-oriented presentations.</li>
</ul></li>
<li>Documentation
<ul class="org-ul">
<li>HTML</li>
<li>PDF</li>
<li>ODT (open office)</li>
<li>Markdown</li>
</ul></li>
<li>Task Juggling
<ul class="org-ul">
<li>iCalendar</li>
<li>Task Juggler</li>
</ul></li>
<li>LaTeX
<ul class="org-ul">
<li>Koma Scrittr?</li>
</ul></li>
<li>man (Linux Man pages)</li>
<li>Freemind (mind mapping)</li>
<li><a href="https://www.gnu.org/software/groff/">Groff</a>
GNU Typesetting system</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga3208d8" class="outline-3">
<h3 id="orga3208d8"><span class="section-number-3">8.4.</span> Babel</h3>
<div class="outline-text-3" id="text-8-4">
<p>
Setting up Babel correctly takes some tweaking&#x2026;
First, head over to your <code>init.el</code> file and tune that for the languages and things you plan to use:
</p>
<pre class="example" id="org983cd71">
;;init.el
;;Filtered for relevance...
:lang
...
emacs-lisp        ; drown in parentheses
ess               ; emacs speaks statistics
markdown          ; writing docs for people to ignore
nix               ; I hereby declare "nix geht mehr!"
org               ; organize your plain life in plain text
python            ; beautiful is better than ugly
sh                ; she sells {ba,z,fi}sh shells on the C xor
...
</pre>

<p>
Check out <a href="https://org-babel.readthedocs.io/en/latest/">this handy guide</a> for way more in-depth examples.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matthew Younger</p>
<p class="date">Created: 2026-01-12 Mon 17:49</p>
</div>
</body>
</html>
